//=================HW8==================
document.write('<br \/> ===============Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)=====================<br \/>')
for (let i = 20; i <= 30; i += 0.5) {
  console.log(i);
  document.write(`${i},`)
}
document.write('<br \/> ===============Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів=====================<br \/>')
const exchangeRate = 40;

for (let dollars = 10; dollars <= 100; dollars += 10) {
  const uah = dollars * exchangeRate;
  //console.log(`${dollars} доларів = ${uah} гривень`);
  document.write(`<br \/>${dollars} доларів = ${uah} гривень`);

}

document.write('<br \/> ===============Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N=====================<br \/>')

const n = prompt('Введіть число, щоб вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа');

for (let i = 1; i <= 100; i++) {
  const square = i * i;
  if (square <= n) {
    console.log(i);
    document.write(`${i},`);

  }
}

document.write('<br \/> ===============Дано ціле число. Зясувати, чи воно є простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе)=====================<br \/>')

const num = prompt('Введіть ціле число, щоб зясувати чи є воно простим');
let isPrime = true;

if (num <= 1) {
  isPrime = false;
} else {
  for (let i = 2; i < num; i++) {
    if (num % i === 0) {
      isPrime = false;
      break;
    }
  }
}
console.log(isPrime)
if (isPrime) {
  //console.log(`${num} є простим числом`);
  document.write(`<br \/>${num} є простим числом`)
} else {
  //console.log(`${num} не є простим числом`);
  document.write(`<br \/>${num} є простим числом`)

}

document.write('<br \/> ===============Дано число. Визначити, чи можна одержати це число шляхом зведення числа 3 деякий ступінь.Наприклад, числа 9, 81 можна отримати, а 13 - не можна====================<br \/>')

let num2 = prompt('Введіть число, щоб визначити чи можна одержати це число шляхом зведення числа 3 деякий ступінь');

while (num2 % 3 == 0) {
  num2 /= 3;
}
document.write((num2 == 1)? "Число можно отримати " : "Число не можна отримати");


